In [11]:
import pandas as pd

In [12]:
data = {'2020' : [9668465, 3391946, 2942828, 1450062],
        '2010' : [10312545, 3567910, 2758296, 1454636]}
df = pd.DataFrame(data)
df

      2020      2010
0  9668465  10312545
1  3391946   3567910
2  2942828   2758296
3  1450062   1454636

#### 1. 인덱스 설정
    1-1. 데이터의 인덱스가 '기본'인 경우 '원하는 인덱스'로 변경  
    - 데이터프레임_변수명.index = [원하는 인덱스(행의 수 동일하게)]  
---
    1-2. 데이터의 인덱스를 '설정'하여 데이터프레임 만들기
    - df = pd.DataFrame(data, index = [원하는 인덱스(행의 수 동일하게)])

In [13]:
df.index = ["서울", "부산", "인천" , "광주",]
df

       2020      2010
서울  9668465  10312545
부산  3391946   3567910
인천  2942828   2758296
광주  1450062   1454636

In [14]:
df = pd.DataFrame(data, index = ["서울", "부산", "인천" , "광주"])
df

       2020      2010
서울  9668465  10312545
부산  3391946   3567910
인천  2942828   2758296
광주  1450062   1454636

#### 2. 인덱스 지정하여 생성(리스트 구조 활용)
    - 데이터의 형태를 리스트로 설정하여 DataFrame에 각각 넣기
    - df2 = pd.DataFrame(데이터_리스트, index = 인덱스_리스트, columns=header_리스트)

In [15]:
data2 = [[9668465, 3391946, 2942828, 1450062],
        [10312545, 3567910, 2758296, 1454636]]
ind = [ '2020','2010']
col = ["서울", "부산", "인천" , "광주"]
df2 = pd.DataFrame(data2, index = ind, columns=col)
df2

            서울       부산       인천       광주
2020   9668465  3391946  2942828  1450062
2010  10312545  3567910  2758296  1454636

##### 2. 데이터프레임 전치(transpose)
    - 데이터프레임_변수명.T

In [16]:
df2.T

       2020      2010
서울  9668465  10312545
부산  3391946   3567910
인천  2942828   2758296
광주  1450062   1454636

##### 3. Values, Index, Columns 확인하기

In [17]:
print(f"""
데이터프레임의 값 확인
{df.values}

데이터프레임의 인덱스 확인
{df.index}

데이터프레임의 컬럼 확인
{df.columns}""")

데이터프레임의 값 확인
[[ 9668465 10312545]
 [ 3391946  3567910]
 [ 2942828  2758296]
 [ 1450062  1454636]]

데이터프레임의 인덱스 확인
Index(['서울', '부산', '인천', '광주'], dtype='object')

데이터프레임의 컬럼 확인
Index(['2020', '2010'], dtype='object')

##### 4. 인덱싱
    - df["원하는_키값"] : 데이터프레임 형태X
    - df[["원하는_키값]] : 데이터프레임 형태

In [18]:
# 열 인덱스 확인하기(열 인덱싱)
df[["2020", "2010"]]

       2020      2010
서울  9668465  10312545
부산  3391946   3567910
인천  2942828   2758296
광주  1450062   1454636

In [19]:
#DataFrame 행 슬라이싱
df[0:2]

       2020      2010
서울  9668465  10312545
부산  3391946   3567910

In [20]:
df['서울':'부산']

       2020      2010
서울  9668465  10312545
부산  3391946   3567910

### DataFrame 슬라이싱 -> 인덱싱
 - loc[]인덱서 : 실제 인덱스 이름을 사용하여 행을 가지고 올 때 사용

In [22]:
df.loc['부산':'인천','2020':'2010']

       2020     2010
부산  3391946  3567910
인천  2942828  2758296